Repository: 4shen/webshell
Catalog: dataset/benign/welaika/wordless-master/locales/wl-*.po
Languages: el

source: Your current theme does not seem to be a Wordless-compatible theme! <a href="%2$s" target="_blank">%1$s</a> (or <a href="%4$s" target="_blank">%3$s</a>)
el: Το τρέχον θέμα σας δεν φαίνεται να είναι ενα Wordless-συμβατό θέμα!<a href="%2$s" target="_blank">%1$s</a> (or <a href="%4$s" target="_blank">%3$s</a>)

source: Create a new Wordless theme
el: Δημιουργια ενος νεου Wordless θέματος

source: learn more about Wordless
el: μάθετε περισσότερα σχετικά με το Wordless

source: Preferences
el: προτιμήσεις

source: New Theme
el: Νέο Θέμα

source: Theme Name
el: Όνομα Θέματος

source: This will be the name displayed inside WordPress.
el: Αυτό θα είναι το όνομα που θα εμφανίζεται στο εσωτερικό του WordPress.

source: Theme Directory
el: Κατάλογος θέματος

source: Specify the <code>wp-content/themes</code> subdirectory name for this theme.
el: Καθορίστε τον <code> wp-content / themes </ code> υποκατάλογο όνοματος για αυτό το θέμα.

source: Permissions
el: Δικαιώματα

source: Specify three octal number components specifying access restrictions
el: Καθορίστε τρεις οκταδικούς συστατικών αριθμους που καθορίζουν τους περιορισμούς στην πρόσβαση

source: This field is required!
el: Αυτό το πεδίο είναι υποχρεωτικό!

source: Preprocessors
el: Προεπεξεργαστές

source: List Preprocessors you need comma separeted (ex: if you use Less replace CompassPreprocessor with LessPreprocessor).
el: Οι προεπεξεργαστες στην λιστα ξεχωριζονται με κόμμα (ex: Αν χρησιμοποιήσετε μικρότερους αντικαταστήστε τον CompassPreprocessor με LessPreprocessor).

source: This enable the wordpress assets cache.
el: Αυτό ενεργοποιει την μνήμη cache του ενεργητικού wordpress.

source: Version
el: Εκδοση

source: Using this function automatically generate the version number. You can of course decide to use a hard-coded version number/string if preferred by changing this preference.
el: Χρησιμοποιώντας αυτή τη λειτουργία δημιουργεί αυτόματα τον αριθμό έκδοσης. Μπορείτε βέβαια να αποφασίσετε να χρησιμοποιήσετε ένα σκληρό κωδικοποιημένο αριθμό έκδοσης / συμβολοσειράς αν προτιμάται από την αλλαγή αυτής της προτίμησης.

source: Compass Path
el: Compass Διαδρομή

source: The compass path on your dev environment (you can found it with: 'which wordless_compass').
el: Η διαδρομή Compass στο περιβάλλον dev (μπορεί να βρεθεί με: «ποια wordless_compass»).

source: Css Compass output style
el: Στυλ εξόδου Css Compass

source: The output style for the compiled css. One of: nested, expanded, compact, or compressed.
el: Το στυλ εξόδου για το CSS. Ένα από: ένθετη, επεκτάθηκε, συμπαγές, ή συμπιεσμένο.

source: Css require libs
el: Το Css απαιτεί libs

source: Additionale Gem Libraries comma separeted.
el: Πρόσθετες Gem Βιβλιοθήκες διαχωρισμένες με κόμμα.

source: Less path
el: Μικροτερο μονοπάτι

source: The Less path on your dev environment.
el: Το μικροτερο μονοπάτι στο περιβάλλον dev.

source: Less compression
el: Μικροτερη συμπίεση

source: Allow or disallow Less output compression.
el: Αποδοχη η αποριψη της μικροτερης εξοδου συμπιεσης.

source: Ruby path
el: Ruby διαδρομή

source: The ruby path on your dev environment (you can found it with: 'which wordless_ruby').
el: Η διαδρομή Ruby στο περιβάλλον dev (μπορεί να βρεθεί με: 'which wordless_ruby').

source: JS compression
el: Συμπίεση JS

source: Allow or disallow JS output compression.
el: Αποδοχη η απαγορευση της JS συμπίεσης εξόδου.

source: JS vars compression
el: JS Vars συμπίεση

source: Allow or disallow JS vars compression.
el: Αποδοχη η απαγορευση της JS vars συμπίεσης εξόδου.

source: Something wrong!
el: Κάτι εγινε λάθος!

source: Preferences saved!
el: Οι προτιμήσεις αποθηκευθηκαν!

source: Search: %s
el: Αναζήτηση: %s

source: Archives: %s
el: Αρχεία: %s

source: Add new %s
el: Προσθήκη νέου %s

source: Edit %s
el: Επεξεργασία %s

source: New %s
el: Νέο %s

source: View %s
el: Εμφανιση %s

source: Search %s
el: Αναζήτηση: %s

source: No %s found.
el: %s δεν βρεθηκε.

source: No %s found in Trash
el: %s δεν βρεθηκε στα σκουπιδια

source: All %s
el: Ολα %s

source: Parent %s
el: Γονεικο %s

source: Parent %s:
el: Γονεικο %s

source: Update %s
el: Ενημερωμένη έκδοση %s

source: New %n Name
el: Νεο %n Ονομα

source: less than a minute
el: λιγότερο από ένα λεπτό

source: 1 minute
el: 1 λεπτο

source: less than 5 seconds
el: λιγότερο από 5 δευτερόλεπτα

source: less than 10 seconds
el: λιγότερο από 10 δευτερόλεπτα

source: less than 20 seconds
el: λιγότερο από 20 δευτερόλεπτα

source: half a minute
el: μισό λεπτό

source: %d minutes
el: %d λεπτά

source: about 1 hour
el: περίπου 1 ώρα

source: about %d hours
el: περίπου %d ώρες

source: 1 day
el: 1 ημέρα

source: %d days
el: %d ημέρες

source: about 1 month
el: περίπου 1 μήνα

source: %d months
el: %d μήνες

source: about 1 year
el: περίπου 1 χρόνος

source: over %d years
el: πάνω από %d χρόνια

source: decade
el: δεκαετία

source: decades
el: δεκαετίες

source: year
el: έτος

source: years
el: έτη

source: month
el: μήνας

source: months
el: μήνες

source: week
el: εβδομάδα

source: weeks
el: εβδομάδες

source: day
el: ημέρα

source: days
el: ημέρες

source: hour
el: ώρα

source: hours
el: ώρες

source: minute
el: λεπτό

source: minutes
el: λεπτά

source: second
el: δευτερόλεπτο

source: seconds
el: δευτερόλεπτα

source: %s ago
el: %s πριν

source: Setting Wordless preferences
el: Ρύθμιση των Wordless προτιμήσεων

source: Save preferences
el: Αποθήκευση προτιμήσεων

source: Create theme and set it as the current one!
el: Δημιουργία θέματος και ρυθμιση ως τρέχον!

source: The path %s doesn't seem to be an executable!
el: Η διαδρομή %s δεν φαίνεται να είναι εκτελέσιμη!
